# RbsDuctFittingLossMethodSettings Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDuctFittingLossMethodSettings Property
ParameterTypeId Class See Also
---
"Loss Method Settings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDuctFittingLossMethodSettings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDuctFittingLossMethodSettings As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDuctFittingLossMethodSettings {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace